{
  "users": [
    {
      "email": "test@gmail.com",
      "name": "José",
      "lastName": "Gomez",
      "password": "Asd12345",
      "id": 1,
      "role": "CLIENT"
    },
    {
      "email": "dani.assa@gmail.com",
      "name": "Daniel",
      "lastName": "Assa",
      "password": "Dani12345",
      "id": 2,
      "role": "ADMIN"
    },
    {
      "email": "dc0000@gmail.com",
      "name": "Daniel",
      "lastName": "Cabral",
      "password": "1234",
      "id": 3,
      "role": "ADMIN"
    }
  ],
  "products": [
    {
      "id": 1,
      "name": "Remera Hanley",
      "price": 5000,
      "photo": "https://i.ibb.co/LSDcCBV/20190918-145808.jpg",
      "categories": [
        "Remeras",
        "Verano"
      ],
      "available": true,
      "description": "Explora el máximo confort y estilo con nuestra remera de algodón premium. Confeccionada con algodón suave y transpirable, esta remera se convertirá en tu nueva favorita en cuanto la pruebes. Su tejido de alta calidad garantiza una sensación ligera y fresca en cualquier estación del año.                              Detalles del Producto: -Material: Algodón 100% premium -Corte: Regular fit para un ajuste cómodo y favorecedor -Cuidado: Lavable a máquina para una fácil limpieza y mantenimiento. Descubre la verdadera esencia del confort y la moda con nuestra remera de algodón premium. No comprometas tu estilo por la comodidad; con esta remera, puedes tener ambos. ¡Haz tu pedido ahora y experimenta la diferencia!",
      "stock":"25"
    },
    {
      "id": 2,
      "name": "Sweater cuello cruzado",
      "price": 3333,
      "photo": "https://i.ibb.co/rH8J8v5/20190717-125830.jpg",
      "categories": [
        "Sweater",
        "Invierno"
      ],
      "available": true,
      "description": "Sumérgete en el lujo cálido y sofisticado de nuestro sweater tejido, una obra maestra de la artesanía textil que combina estilo y comodidad en perfecta armonía. Cuidadosamente confeccionado a mano por expertos tejedores, este sweater encarna la esencia de la elegancia contemporánea. La suavidad indulgente del tejido abraza tu piel, proporcionando una sensación de calidez y confort en cada uso. Su diseño meticulosamente elaborado presenta detalles intrincados y una textura táctil que cautiva la mirada y despierta los sentidos. Ideal para las noches frescas de otoño e invierno, este sweater se convierte en una declaración de estilo, realzando tu apariencia con su allure artística. Ya sea para una cena íntima o un paseo por la ciudad, este sweater tejido te envuelve en un abrazo elegante, asegurando que te destaques con distinción en cada ocasión. Vive el encanto del tejido artesanal y descubre la magia de la moda con nuestro sweater tejido, donde la tradición se encuentra con la moda contemporánea.",
      "stock":"15"
    },
    {
      "id": 3,
      "name": "Short de baño (naranja)",
      "price": 12500,
      "photo": "https://i.ibb.co/S3Y3dJt/IMG-20191217-002300.jpg",
      "categories": [
        "Short de baño",
        "Verano"
      ],
      "available": true,
      "description": "Prepárate para un verano lleno de diversión y estilo con nuestro short de baño, diseñado para los aventureros modernos que buscan combinar comodidad y moda en la playa y más allá. Hecho de un tejido ligero y de secado rápido, este short te brinda libertad de movimiento mientras te sumerges en las olas o disfrutas del sol en la arena. Su cintura elástica y cordón ajustable garantizan un ajuste perfecto para todos los tamaños, mientras que su diseño vibrante y colorido añade un toque de energía a tu estilo playero. Con bolsillos prácticos para llevar tus pertenencias de forma segura, este short de baño es más que una prenda: es un accesorio imprescindible para tus días de playa y piscina. Ya sea que estés surfeando, jugando vóley o simplemente relajándote, este short de baño te permite expresar tu personalidad mientras te sumerges en la diversión del verano. ¡Prepárate para deslumbrar en la costa con nuestro short de baño y haz una declaración de estilo sin decir una palabra!",
      "stock":"10"
    },
    {
      "id": 4,
      "name": "Zapato suela",
      "price": 35000,
      "photo": "https://i.ibb.co/wNtM4Zj/20190721-120609.jpg",
      "categories": [
        "Calzado",
        "Zapatos"
      ],
      "available": true,
      "description": "Descubre el equilibrio perfecto entre elegancia y funcionalidad con nuestros zapatos de cuero, diseñados para hacer una declaración de estilo sin sacrificar la comodidad. Confeccionados con cuero genuino que garantiza durabilidad y un tacto suave, estos zapatos destacan por su suela de caucho resistente, ofreciéndote tracción confiable y resistencia al desgaste en cada paso que das. La plantilla acolchada proporciona soporte adicional, permitiéndote llevarlos durante todo el día sin fatiga. Ya sea para una ocasión formal o una salida casual, estos zapatos son la opción ideal para el hombre moderno que busca calidad, estilo y versatilidad. Eleva tu estilo con nuestros zapatos de cuero con suela de caucho y experimenta la combinación perfecta de moda y funcionalidad en cada paso.",
      "stock":"50"
    }
  ]
}